Зачет/src/Documents/ЗаявкаНаПеревозкуГруза/ЗаявкаНаПеревозкуГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПеревозкуГруза</name>
  <registerRecords>InformationRegister.СостояниеЗаявок</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипГруза</name>
    <type>
      <types>CatalogRef.ТипыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодтиельИсполнитель</name>
    <type>
      <types>CatalogRef.Грузоперевозчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Зачет/src/InformationRegisters/СостояниеЗаявок/СостояниеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЗаявок</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВесГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПеревозкуГруза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Грузоперевозчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зачет/src/Documents/ЗаявкаНаПеревозкуГруза/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СостояниеЗаявок
	Движения.СостояниеЗаявок.Записывать = Истина;
	Движение = Движения.СостояниеЗаявок.Добавить();
	Движение.Заявка = Ссылка;
	Движение.Водитель = ВодтиельИсполнитель;
	Движение.Автомобиль = ВодтиельИсполнитель.Автомобиль;
	Движение.ВесГруза = ВесГруза;
	Движение.Расстояние = Расстояние;
	Движение.ВремяОжидания = СрокДоставки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
